<?php

return [
    'status_id' => [
        'new' => '1', /** 新規受付. */
        'cancel' => '3', /** 注文取消し. */
        'in_progress' => '4', /** 対応中. */
        'delivered' => '5', /** 発送済み. */
        'paid' => '6', /** 入金済み. */
        'pending' => '7', /** 決済処理中. */
        'processing' => '8', /** 購入処理中. */
        'returned' => '9', /** 返品 */
    ],
    'delivery_time' => [
        '1' => '指定なし',
        '2' => '午前中',
        '3' => '14時〜16時',
        '4' => '16時〜18時',
        '5' => '18時〜20時',
        '6' => '19時〜21時',
    ],
];
